; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 44)
	(= (value c1) 21)
	(= (value c2) 55)
	(= (value c3) 96)
	(= (value c4) 16)
	(= (value c5) 51)
	(= (value c6) 64)
	(= (value c7) 69)
	(= (value c8) 83)
	(= (value c9) 15)
	(= (value c10) 39)
	(= (value c11) 95)
	(= (value c12) 36)
	(= (value c13) 88)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 9 of 13
2. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 9 of 13
3. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 9 of 13
4. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 9 of 13
5. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 9 of 13
6. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 9 of 13
7. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 9 of 13
8. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 9 of 13
9. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 9 of 13
10. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 9 of 13
11. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 9 of 13
12. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 9 of 13
13. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 9 of 13
14. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 9 of 13
15. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 9 of 13
16. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 9 of 13
17. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 9 of 13
18. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 9 of 13
19. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 9 of 13
20. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 9 of 13
21. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 9 of 13
22. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 9 of 13
23. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 9 of 13
24. (increment c12)
   changed: (value c12) from 36 to 45
   goals met: 9 of 13
25. (increment c12)
   changed: (value c12) from 45 to 54
   goals met: 9 of 13
26. (increment c12)
   changed: (value c12) from 54 to 63
   goals met: 9 of 13
27. (increment c12)
   changed: (value c12) from 63 to 72
   goals met: 9 of 13
28. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 9 of 13
29. (increment c12)
   changed: (value c12) from 72 to 82
   goals met: 9 of 13
30. (increment c12)
   changed: (value c12) from 82 to 92
   goals met: 8 of 13
31. (decrement c11)
   changed: (value c11) from 95 to 91
   goals met: 9 of 13
32. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 9 of 13
33. (increment c4)
   changed: (value c4) from 16 to 24
   goals met: 9 of 13
34. (increment c4)
   changed: (value c4) from 24 to 32
   goals met: 9 of 13
35. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 9 of 13
36. (increment c4)
   changed: (value c4) from 32 to 41
   goals met: 9 of 13
37. (increment c4)
   changed: (value c4) from 41 to 50
   goals met: 9 of 13
38. (increment c4)
   changed: (value c4) from 50 to 59
   goals met: 8 of 13
39. (increment c4)
   changed: (value c4) from 59 to 68
   goals met: 8 of 13
40. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 8 of 13
41. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 8 of 13
42. (decrement c4)
   changed: (value c4) from 68 to 59
   goals met: 8 of 13
43. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 8 of 13
44. (increment c4)
   changed: (value c4) from 59 to 68
   goals met: 8 of 13
45. (decrement c3)
   changed: (value c3) from 96 to 93
   goals met: 8 of 13
46. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 8 of 13
47. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 8 of 13
48. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 8 of 13
49. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 8 of 13
50. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 8 of 13
51. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 8 of 13
52. (increment c1)
   changed: (value c1) from 21 to 27
   goals met: 8 of 13
53. (increment c1)
   changed: (value c1) from 27 to 33
   goals met: 8 of 13
54. (increment c1)
   changed: (value c1) from 33 to 39
   goals met: 8 of 13
55. (increment c1)
   changed: (value c1) from 39 to 45
   goals met: 9 of 13
56. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 9 of 13
57. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 9 of 13
58. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 9 of 13
59. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 9 of 13
60. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 9 of 13
61. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 9 of 13
62. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 9 of 13
63. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 9 of 13
64. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 9 of 13
65. (increment c9)
   changed: (value c9) from 15 to 24
   goals met: 9 of 13
66. (increment c9)
   changed: (value c9) from 24 to 33
   goals met: 9 of 13
67. (increment c9)
   changed: (value c9) from 33 to 42
   goals met: 8 of 13
68. (increment c9)
   changed: (value c9) from 42 to 51
   goals met: 8 of 13
69. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 8 of 13
70. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 8 of 13
71. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 8 of 13
72. (increment c9)
   changed: (value c9) from 51 to 60
   goals met: 8 of 13
73. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 8 of 13
74. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 8 of 13
75. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 8 of 13
76. (decrement c4)
   changed: (value c4) from 68 to 58
   goals met: 8 of 13
77. (decrement c3)
   changed: (value c3) from 93 to 88
   goals met: 8 of 13
78. (decrement c4)
   changed: (value c4) from 58 to 48
   goals met: 9 of 13
79. (decrement c3)
   changed: (value c3) from 88 to 83
   goals met: 9 of 13
80. (decrement c3)
   changed: (value c3) from 83 to 78
   goals met: 9 of 13
81. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 9 of 13
82. (increment c4)
   changed: (value c4) from 48 to 58
   goals met: 8 of 13
83. (decrement c3)
   changed: (value c3) from 78 to 72
   goals met: 8 of 13
84. (decrement c4)
   changed: (value c4) from 58 to 48
   goals met: 9 of 13
85. (decrement c3)
   changed: (value c3) from 72 to 66
   goals met: 9 of 13
86. (decrement c3)
   changed: (value c3) from 66 to 60
   goals met: 9 of 13
87. (increment c10)
   changed: (value c10) from 39 to 40
   goals met: 9 of 13
88. (increment c9)
   changed: (value c9) from 60 to 70
   goals met: 9 of 13
89. (decrement_rate c10)
   changed: (rate_value c10) from 1 to 0
   goals met: 9 of 13
90. (decrement c9)
   changed: (value c9) from 70 to 60
   goals met: 9 of 13
91. (decrement c12)
   changed: (value c12) from 92 to 82
   goals met: 9 of 13
92. (decrement c11)
   changed: (value c11) from 91 to 87
   goals met: 9 of 13
93. (decrement c11)
   changed: (value c11) from 87 to 83
   goals met: 9 of 13
94. (decrement c11)
   changed: (value c11) from 83 to 79
   goals met: 10 of 13
95. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 10 of 13
96. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 10 of 13
97. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 10 of 13
98. (decrement c8)
   changed: (value c8) from 83 to 78
   goals met: 10 of 13
99. (decrement c8)
   changed: (value c8) from 78 to 73
   goals met: 10 of 13
100. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 10 of 13
101. (decrement c9)
   changed: (value c9) from 60 to 50
   goals met: 10 of 13
102. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 10 of 13
103. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 10 of 13
104. (decrement c8)
   changed: (value c8) from 73 to 66
   goals met: 9 of 13
105. (increment c10)
   changed: (value c10) from 40 to 41
   goals met: 9 of 13
106. (increment c9)
   changed: (value c9) from 50 to 60
   goals met: 9 of 13
107. (increment c9)
   changed: (value c9) from 60 to 70
   goals met: 10 of 13
108. (decrement_rate c10)
   changed: (rate_value c10) from 1 to 0
   goals met: 10 of 13
109. (decrement c9)
   changed: (value c9) from 70 to 60
   goals met: 9 of 13
110. (decrement c9)
   changed: (value c9) from 60 to 50
   goals met: 9 of 13
111. (decrement c8)
   changed: (value c8) from 66 to 59
   goals met: 9 of 13
112. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 9 of 13
113. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 9 of 13
114. (increment c8)
   changed: (value c8) from 59 to 66
   goals met: 9 of 13
115. (decrement c7)
   changed: (value c7) from 69 to 67
   goals met: 9 of 13
116. (decrement c7)
   changed: (value c7) from 67 to 65
   goals met: 10 of 13
117. (decrement c3)
   changed: (value c3) from 60 to 54
   goals met: 9 of 13
118. (decrement c3)
   changed: (value c3) from 54 to 48
   goals met: 9 of 13
119. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 9 of 13
120. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 9 of 13
121. (increment c4)
   changed: (value c4) from 48 to 58
   goals met: 9 of 13
122. (increment c3)
   changed: (value c3) from 48 to 56
   goals met: 10 of 13
123. (increment c9)
   changed: (value c9) from 50 to 60
   goals met: 10 of 13
124. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 10 of 13
125. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 10 of 13
126. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 10 of 13
127. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 10 of 13
128. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 10 of 13
129. (increment c10)
   changed: (value c10) from 41 to 46
   goals met: 10 of 13
130. (increment c10)
   changed: (value c10) from 46 to 51
   goals met: 10 of 13
131. (increment c10)
   changed: (value c10) from 51 to 56
   goals met: 10 of 13
132. (increment c10)
   changed: (value c10) from 56 to 61
   goals met: 11 of 13
133. (increment c9)
   changed: (value c9) from 60 to 70
   goals met: 11 of 13
134. (increment c10)
   changed: (value c10) from 61 to 66
   goals met: 11 of 13
135. (increment c10)
   changed: (value c10) from 66 to 71
   goals met: 12 of 13
136. (decrement c4)
   changed: (value c4) from 58 to 48
   goals met: 12 of 13
137. (decrement c3)
   changed: (value c3) from 56 to 48
   goals met: 11 of 13
138. (decrement c3)
   changed: (value c3) from 48 to 40
   goals met: 12 of 13
139. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 12 of 13
140. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 12 of 13
141. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 12 of 13
142. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 12 of 13
143. (decrement c2)
   changed: (value c2) from 55 to 51
   goals met: 12 of 13
144. (decrement c2)
   changed: (value c2) from 51 to 47
   goals met: 12 of 13
145. (decrement c2)
   changed: (value c2) from 47 to 43
   goals met: 11 of 13
146. (decrement c2)
   changed: (value c2) from 43 to 39
   goals met: 12 of 13
147. (decrement c1)
   changed: (value c1) from 45 to 39
   goals met: 11 of 13
148. (decrement c1)
   changed: (value c1) from 39 to 33
   goals met: 12 of 13
149. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 12 of 13
150. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 12 of 13
151. (decrement c0)
   changed: (value c0) from 44 to 40
   goals met: 12 of 13
152. (decrement c0)
   changed: (value c0) from 40 to 36
   goals met: 12 of 13
153. (decrement c0)
   changed: (value c0) from 36 to 32
   goals met: 13 of 13
